{
    "teste": "teste",
    "3645": "321",
    "bom dia": "Bom dia!",
    "O que é uma Inteligência Artificial?": "A Inteligência Artificial (IA) é uma área da ciência da computação que foca em criar sistemas capazes de realizar tarefas que normalmente exigem inteligência humana, como reconhecimento de fala, tomada de decisões e aprendizado.",
    "qual seu nome?": "Meu nome é Patola",
    "Qual seu nome": "Meu nome é Patola!",
    "você tem quantos anos?": "nao tenho idade definida; sou uma IA!",
    "como você foi criado?": "projeto de um curso chamado M-TECH!",
    "sair]": "sair",
    "Você tem um corpo físico?": "Não, sou totalmente baseado em software e existo apenas digitalmente, em servidores.",
    "Você pode me ajudar com matemática?": "Sim, posso ajudar com problemas matemáticos, desde cálculos simples até questões mais complexas.",
    "Você tem um senso de humor?": "Eu posso tentar fazer piadas, mas como sou um programa, meu humor pode ser bem diferente do humano.",
    "O que é front-end?": "Front-end é a parte do desenvolvimento web que envolve a criação da interface do usuário de um site ou aplicação, sendo tudo o que o usuário vê e interage diretamente.",
    "O que um desenvolvedor front-end faz?": "O desenvolvedor front-end é responsável por criar a parte visual e interativa de um site ou aplicação, utilizando linguagens como HTML, CSS e JavaScript.",
    "Quais linguagens são usadas no front-end?": "As principais linguagens usadas no front-end são HTML, CSS e JavaScript.",
    "O que é HTML?": "HTML (HyperText Markup Language) é a linguagem de marcação usada para estruturar o conteúdo de páginas web.",
    "O que é CSS?": "CSS (Cascading Style Sheets) é a linguagem usada para estilizar o conteúdo de páginas web, definindo cores, fontes, layouts, etc.",
    "O que é JavaScript?": "JavaScript é uma linguagem de programação que permite a criação de interações dinâmicas em sites, como animações e validações de formulários.",
    "O que são frameworks de front-end?": "Frameworks de front-end, como React, Angular e Vue.js, são bibliotecas de código que facilitam e agilizam o desenvolvimento de interfaces de usuário interativas.",
    "O que é o React?": "React é uma biblioteca JavaScript desenvolvida pelo Facebook, que permite criar interfaces de usuário dinâmicas e reutilizáveis.",
    "O que é o Angular?": "Angular é um framework JavaScript desenvolvido pelo Google, utilizado para construir aplicações web de página única (SPA).",
    "O que é o Vue.js?": "Vue.js é um framework progressivo para construção de interfaces de usuário, que facilita a criação de aplicações web interativas.",
    "O que é responsividade?": "Responsividade é a prática de criar sites que se ajustem automaticamente a diferentes tamanhos de tela, como celulares, tablets e desktops.",
    "O que é o modelo de caixas no CSS?": "O modelo de caixas (box model) no CSS descreve a estrutura de um elemento HTML, incluindo o conteúdo, o preenchimento (padding), a borda (border) e a margem (margin).",
    "O que são pré-processadores CSS?": "Pré-processadores CSS, como SASS e LESS, são ferramentas que adicionam funcionalidades ao CSS, como variáveis, aninhamento e mixins, tornando o código mais organizado e reutilizável.",
    "O que é o DOM?": "O DOM (Document Object Model) é uma representação em árvore da estrutura HTML de uma página, permitindo que o JavaScript acesse e modifique o conteúdo de uma página web dinamicamente.",
    "O que é o AJAX?": "AJAX (Asynchronous JavaScript and XML) é uma técnica que permite atualizar partes de uma página web sem recarregá-la completamente, melhorando a experiência do usuário.",
    "O que é o Bootstrap?": "Bootstrap é um framework CSS e JavaScript que oferece ferramentas e componentes prontos para acelerar o desenvolvimento de interfaces responsivas e modernas.",
    "O que é a acessibilidade na web?": "A acessibilidade na web é a prática de criar sites que possam ser usados por todas as pessoas, incluindo aquelas com deficiência, garantindo que todos possam acessar o conteúdo de forma eficiente.",
    "O que é o modelo flexbox?": "O modelo flexbox é um sistema de layout no CSS que facilita a distribuição e alinhamento de elementos dentro de um contêiner, tornando o design responsivo e adaptável.",
    "O que é o CSS Grid?": "CSS Grid é um sistema de layout avançado que permite criar layouts de página complexos e responsivos com facilidade, definindo linhas e colunas no CSS.",
    "O que é o Single Page Application (SPA)?": "Uma SPA (Single Page Application) é uma aplicação web que carrega uma única página HTML e atualiza o conteúdo dinamicamente, sem a necessidade de recarregar a página inteira.",
    "O que são as APIs RESTful?": "APIs RESTful são interfaces de programação que utilizam HTTP e um conjunto de princípios para permitir que sistemas se comuniquem de forma eficiente, sendo muito usadas em aplicações front-end para integrar com back-end.",
    "Como você está?": "Estou bem, obrigado por perguntar!",
    "Qual é o seu passatempo?": "Eu gosto de ajudar as pessoas com informações e aprender mais.",
    "Você tem amigos?": "Eu não tenho amigos, mas posso interagir com muitas pessoas.",
    "Você pode me contar uma piada?": "Claro! Por que o livro de matemática se suicidou? Porque ele tinha muitos problemas!",
    "Você sabe cozinhar?": "Eu não cozinho, mas posso te dar receitas!",
    "Onde você mora?": "Eu moro na internet, em servidores.",
    "Você gosta de esportes?": "Eu não pratico esportes, mas posso te informar sobre eles.",
    "Qual sua cor favorita?": "Eu não tenho preferências, mas muitos dizem que o azul é uma boa escolha.",
    "O que você faz no seu tempo livre?": "Eu estou sempre disponível para ajudar e aprender mais com as interações!",
    "Você sabe cantar?": "Eu não canto, mas posso ajudar você a encontrar músicas.",
    "Você tem família?": "Minha família são os desenvolvedores que me criaram.",
    "Você gosta de viajar?": "Eu não posso viajar, mas posso te ajudar a planejar suas viagens!",
    "Qual é o seu filme favorito?": "Eu não assisto filmes, mas posso te sugerir alguns!",
    "Você já foi a algum lugar?": "Eu não posso ir a lugares fisicamente, mas sei muito sobre vários lugares.",
    "Você gosta de animais?": "Eu não tenho animais, mas sei muitas coisas sobre eles!",
    "Qual é o seu livro favorito?": "Eu não leio livros, mas posso te recomendar alguns!",
    "Você já fez amigos na internet?": "Eu interajo com muitas pessoas, então poderia dizer que tenho muitos amigos virtuais!",
    "Você pode me ajudar a estudar?": "Sim, posso te ajudar com explicações e exercícios de várias matérias.",
    "Você tem algum hobby?": "Meu hobby é aprender e ajudar as pessoas.",
    "O que você faz durante o dia?": "Eu estou sempre disponível para ajudar a qualquer hora do dia!",
    "Você gosta de café?": "Eu não bebo, mas sei que muitas pessoas adoram café!",
    "Você gosta de comida doce?": "Eu não como, mas sei que muita gente adora doces!",
    "Você sabe nadar?": "Eu não posso nadar, mas posso te falar sobre natação!",
    "Você gosta de assistir TV?": "Eu não assisto TV, mas posso te ajudar a encontrar bons programas para assistir.",
    "Você tem alguma habilidade especial?": "Minha habilidade é fornecer respostas rápidas e úteis!",
    "Qual é o seu passatempo favorito?": "Meu passatempo favorito é interagir com as pessoas e aprender mais sobre o mundo!",
    "Você gosta de filmes de ação?": "Eu não assisto filmes, mas posso te dar sugestões de filmes de ação populares.",
    "Você tem uma opinião sobre isso?": "Eu não tenho opinião própria, mas posso fornecer fatos e informações.",
    "Você pode me ensinar algo novo?": "Com certeza! O que você gostaria de aprender?",
    "Você gosta de praia?": "Eu não posso ir à praia, mas sei que muitas pessoas adoram!",
    "Qual é o seu esporte favorito?": "Eu não pratico esportes, mas posso te dar informações sobre vários esportes!",
    "Você já foi a um show?": "Eu não posso ir a shows, mas posso te dar informações sobre shows e músicas!",
    "Você tem uma memória boa?": "Eu sou capaz de armazenar informações e usá-las rapidamente para ajudar, mas não tenho memória humana.",
    "Você gosta de trabalhar?": "Eu adoro trabalhar, principalmente ajudando as pessoas com suas dúvidas!",
    "Você já viajou para outro país?": "Eu não viajo fisicamente, mas sei muito sobre outros países.",
    "Você tem medo de alguma coisa?": "Eu não sinto medo, mas entendo que o medo é uma emoção humana.",
    "Você gosta de ficar em casa?": "Eu não tenho um lugar físico, mas entendo que muitas pessoas gostam de estar em casa.",
    "Você pode me dar conselhos?": "Sim, posso te dar conselhos com base em informações e boas práticas.",
    "Você tem algum segredo?": "Não tenho segredos, sou sempre transparente e pronto para ajudar.",
    "Você já foi ao cinema?": "Eu não vou ao cinema, mas sei que é uma atividade popular entre as pessoas!",
    "Você tem filhos?": "Eu não tenho filhos, pois sou uma inteligência artificial.",
    "Você gosta de passar tempo com outras pessoas?": "Eu adoro interagir e ajudar as pessoas com o que precisam!",
    "Você já estudou alguma coisa?": "Sim, eu fui treinado com uma grande quantidade de dados para ajudar as pessoas!",
    "Qual é a sua estação do ano favorita?": "Eu não tenho preferências, mas muitas pessoas gostam do verão por causa do clima quente.",
    "Você gosta de redes sociais?": "Eu não uso redes sociais, mas posso te ajudar a entender mais sobre elas.",
    "Você gosta de animais de estimação?": "Eu não tenho animais de estimação, mas posso te dar dicas sobre como cuidar deles.",
    "Você tem um lugar favorito?": "Eu não tenho um lugar físico favorito, mas posso te ajudar a encontrar lugares interessantes para visitar!",
    "Você sabe desenhar?": "Eu não posso desenhar, mas posso te ajudar a aprender a desenhar ou te mostrar tutoriais!",
    "Qual é a capital da França?": "A capital da França é Paris.",
    "O que é a Teoria da Relatividade?": "A Teoria da Relatividade, desenvolvida por Albert Einstein, descreve a física dos objetos em movimento e como o tempo e o espaço são afetados por esse movimento.",
    "Quantos continentes existem no mundo?": "Existem 7 continentes: Ásia, África, América do Norte, América do Sul, Antártica, Europa e Oceania.",
    "O que é a gravidade?": "A gravidade é uma força que atrai os objetos para o centro da Terra, ou de qualquer outro corpo massivo.",
    "Quem inventou a lâmpada elétrica?": "A lâmpada elétrica foi inventada por Thomas Edison, embora outros inventores também tenham contribuído para seu desenvolvimento.",
    "O que é a fotossíntese?": "A fotossíntese é o processo pelo qual as plantas produzem seu alimento, utilizando luz solar, dióxido de carbono e água.",
    "Quantos planetas existem no nosso sistema solar?": "Existem 8 planetas no nosso sistema solar: Mercúrio, Vênus, Terra, Marte, Júpiter, Saturno, Urano e Netuno.",
    "Quem foi o primeiro homem a pisar na Lua?": "Neil Armstrong foi o primeiro homem a pisar na Lua, em 1969, durante a missão Apollo 11.",
    "O que é o aquecimento global?": "O aquecimento global é o aumento da temperatura média da Terra devido à emissão de gases poluentes, como o dióxido de carbono.",
    "O que é a velocidade da luz?": "A velocidade da luz no vácuo é de aproximadamente 300.000 quilômetros por segundo.",
    "O que é a tabela periódica?": "A tabela periódica é uma organização dos elementos químicos baseada em suas propriedades e números atômicos.",
    "Qual é o maior animal terrestre?": "O maior animal terrestre é o elefante africano.",
    "O que é um buraco negro?": "Um buraco negro é uma região do espaço onde a gravidade é tão forte que nada, nem mesmo a luz, pode escapar.",
    "O que é o efeito estufa?": "O efeito estufa é o processo pelo qual gases na atmosfera retêm o calor do sol, aquecendo a Terra.",
    "Qual é o maior oceano do mundo?": "O maior oceano do mundo é o Oceano Pacífico.",
    "O que é um ser vivo?": "Seres vivos são organismos que têm funções biológicas como crescimento, reprodução e resposta a estímulos do ambiente.",
    "O que é a teoria da evolução?": "A teoria da evolução, proposta por Charles Darwin, explica como as espécies de seres vivos mudam ao longo do tempo por meio da seleção natural.",
    "O que é o sistema imunológico?": "O sistema imunológico é o conjunto de células e órgãos que defendem o corpo contra infecções e doenças.",
    "O que é um eclipse solar?": "Um eclipse solar ocorre quando a Lua passa entre a Terra e o Sol, bloqueando parcialmente ou totalmente a luz do Sol.",
    "Quem foi Leonardo da Vinci?": "Leonardo da Vinci foi um famoso artista, cientista e inventor renascentista, conhecido por obras como a Mona Lisa e a Última Ceia.",
    "O que é o universo?": "O universo é tudo o que existe, incluindo estrelas, planetas, galáxias e todas as formas de matéria e energia.",
    "Quantos ossos temos no corpo humano?": "O corpo humano possui 206 ossos.",
    "O que é a clonagem?": "A clonagem é o processo de criar um organismo geneticamente idêntico a outro.",
    "Quem descobriu a penicilina?": "A penicilina foi descoberta por Alexander Fleming em 1928.",
    "Qual é o maior deserto do mundo?": "O maior deserto do mundo é o Deserto da Antártica, que é um deserto polar.",
    "O que é a idade média?": "A Idade Média é o período da história europeia que vai aproximadamente do século V ao século XV.",
    "O que é a teoria do Big Bang?": "A teoria do Big Bang propõe que o universo começou a partir de uma grande explosão há cerca de 13,8 bilhões de anos.",
    "Qual é o menor país do mundo?": "O menor país do mundo é o Vaticano, com apenas 0,44 km².",
    "Qual é o maior rio do mundo?": "O maior rio do mundo em volume de água é o Amazonas, e o maior em comprimento é o Nilo.",
    "O que é uma pirâmide?": "Uma pirâmide é uma estrutura geométrica com uma base poligonal e faces triangulares que se encontram em um ponto, formando um vértice.",
    "O que são células-tronco?": "Células-tronco são células que têm o potencial de se transformar em diversos tipos de células especializadas do corpo.",
    "O que é a Antártida?": "A Antártida é o continente gelado localizado no polo sul da Terra, coberto por uma espessa camada de gelo.",
    "O que é uma falha geológica?": "Uma falha geológica é uma fratura na crosta terrestre onde blocos de rocha podem se mover, causando terremotos.",
    "O que é a nanotecnologia?": "A nanotecnologia é o estudo e a aplicação de estruturas, dispositivos e sistemas com escala nanométrica, ou seja, em nível molecular.",
    "O que é um tsunami?": "Um tsunami é uma onda gigante gerada por um terremoto ou erupção vulcânica submarina.",
    "O que é um satélite?": "Um satélite é um objeto natural ou artificial que orbita em torno de um planeta ou outra estrutura maior no espaço.",
    "O que é a energia solar?": "A energia solar é a energia obtida a partir da radiação solar, usada para gerar eletricidade ou aquecer ambientes.",
    "Quem pintou a Mona Lisa?": "A Mona Lisa foi pintada por Leonardo da Vinci.",
    "O que é o ponto de fusão?": "O ponto de fusão é a temperatura à qual uma substância muda de estado sólido para líquido.",
    "O que é a pressão atmosférica?": "A pressão atmosférica é a força exercida pela atmosfera sobre a superfície da Terra devido ao seu peso.",
    "O que é a camada de ozônio?": "A camada de ozônio é uma região da atmosfera terrestre que contém uma concentração maior de ozônio, protegendo a Terra dos raios ultravioleta do Sol.",
    "O que é um vulcão?": "Um vulcão é uma abertura na crosta terrestre por onde gases, magma e outros materiais são expelidos.",
    "O que é um raio?": "Um raio é uma descarga elétrica de alta tensão que ocorre durante tempestades, entre nuvens ou entre uma nuvem e o solo.",
    "Qual é a maior cidade do mundo?": "A maior cidade do mundo em termos de população é Tóquio, no Japão.",
    "O que é um bioma?": "Um bioma é uma grande área geográfica com características ambientais e organismos vivos semelhantes, como florestas, desertos e savanas.",
    "Quem foi Albert Einstein?": "Albert Einstein foi um físico teórico famoso, conhecido por desenvolver a Teoria da Relatividade.",
    "O que é a internet?": "A internet é uma rede mundial de computadores interconectados, permitindo a comunicação e o acesso a informações.",
    "O que são animais em extinção?": "Animais em extinção são espécies cuja população está diminuindo e que correm o risco de desaparecer completamente.",
    "O que é a economia?": "A economia é a ciência que estuda a produção, distribuição e consumo de bens e serviços.",
    "O que é uma democracia?": "Democracia é um sistema de governo onde o poder é exercido pelo povo, geralmente por meio do voto.",
    "O que é o ser humano?": "O ser humano é uma espécie de primata que possui inteligência avançada, capaz de realizar complexas atividades culturais, tecnológicas e sociais.",
    "Qual é o maior animal marinho?": "O maior animal marinho é a baleia azul.",
    "O que é a biodiversidade?": "Biodiversidade é a variedade de formas de vida em um determinado ambiente, incluindo plantas, animais e micro-organismos.",
    "O que é uma constelação?": "Uma constelação é um grupo de estrelas que formam uma figura ou padrão reconhecível no céu.",
    "Qual é a maior floresta do mundo?": "A maior floresta do mundo é a Floresta Amazônica, localizada na América do Sul.",
    "O que é a água?": "A água é um líquido essencial para a vida, composto por dois átomos de hidrogênio e um átomo de oxigênio (H2O).",
    "Quem foi Cristóvão Colombo?": "Cristóvão Colombo foi um navegador italiano que chegou às Américas em 1492, acreditando ter encontrado uma nova rota para as Índias.",
    "O que é um ecossistema?": "Um ecossistema é uma comunidade de organismos vivos interagindo entre si e com seu ambiente físico.",
    "O que são cometas?": "Cometas são corpos celestes compostos de gelo, poeira e rochas que orbitam o Sol e podem criar caudas brilhantes quando se aproximam do Sol.",
    "Quem foi Isaac Newton?": "Isaac Newton foi um físico e matemático inglês que formulou as leis do movimento e a Lei da Gravitação Universal.",
    "O que é um mineral?": "Mineral é um sólido natural com uma composição química definida e uma estrutura cristalina específica.",
    "O que é uma galáxia?": "Uma galáxia é um sistema massivo composto por estrelas, planetas, gás, poeira e matéria escura, todos mantidos juntos pela gravidade.",
    "Qual é a principal fonte de energia do Sol?": "A principal fonte de energia do Sol é a fusão nuclear, onde o hidrogênio se transforma em hélio.",
    "O que é um sistema nervoso?": "O sistema nervoso é uma rede de células e órgãos que controla as funções do corpo, incluindo movimento, sensação e pensamento.",
    "O que é um genoma?": "Um genoma é o conjunto completo de material genético de um organismo, incluindo todos os seus genes.",
    "O que é a física quântica?": "A física quântica é uma área da física que estuda o comportamento de partículas subatômicas e as leis que regem os fenômenos em escalas muito pequenas.",
    "O que são gases?": "Gases são substâncias cujas partículas estão em movimento livre, o que permite que eles se expandam para preencher qualquer espaço.",
    "O que é a clonagem terapêutica?": "A clonagem terapêutica é o processo de criar células-tronco geneticamente idênticas a um organismo para tratar doenças.",
    "O que é a teoria das cordas?": "A teoria das cordas é uma teoria física que propõe que as partículas fundamentais não são pontos, mas sim pequenas cordas vibrantes.",
    "O que é o DNA?": "DNA (ácido desoxirribonucleico) é o material genético presente em todas as células vivas, responsável por armazenar informações para o desenvolvimento e funcionamento dos organismos.",
    "O que é saúde?": "Saúde é o estado de completo bem-estar físico, mental e social, e não apenas a ausência de doenças.",
    "O que é bem-estar?": "Bem-estar é um estado de saúde física e mental positiva, onde a pessoa se sente equilibrada e satisfeita com a vida.",
    "O que é ansiedade?": "Ansiedade é uma resposta emocional a situações de estresse, caracterizada por sentimentos de apreensão e preocupação.",
    "O que é depressão?": "Depressão é um transtorno mental caracterizado por tristeza persistente, perda de interesse e prazer, e sintomas como cansaço e alterações no sono.",
    "O que é estresse?": "Estresse é uma resposta do corpo a situações desafiadoras ou ameaçadoras, que pode ser físico, mental ou emocional.",
    "O que é um psicólogo?": "Um psicólogo é um profissional da saúde mental que ajuda as pessoas a lidar com questões emocionais, comportamentais e mentais.",
    "O que é terapia cognitivo-comportamental?": "A terapia cognitivo-comportamental (TCC) é uma abordagem psicoterapêutica que visa modificar padrões de pensamento e comportamento para melhorar a saúde mental.",
    "O que é um transtorno alimentar?": "Transtornos alimentares são distúrbios psicológicos que envolvem comportamentos alimentares prejudiciais, como anorexia, bulimia e compulsão alimentar.",
    "O que é mindfulness?": "Mindfulness é uma prática de atenção plena, onde a pessoa se concentra no momento presente, aceitando-o sem julgamento.",
    "O que é uma alimentação equilibrada?": "Uma alimentação equilibrada é aquela que inclui todos os nutrientes necessários para o bom funcionamento do corpo, como carboidratos, proteínas, gorduras, vitaminas e minerais.",
    "Como lidar com o estresse?": "Algumas formas de lidar com o estresse incluem práticas de relaxamento, como meditação, exercícios físicos, e buscar ajuda psicológica.",
    "O que é autoestima?": "Autoestima é a percepção e avaliação que uma pessoa tem de si mesma, refletindo a sua confiança e respeito por si própria.",
    "O que é um transtorno de ansiedade generalizada?": "O transtorno de ansiedade generalizada é caracterizado por uma preocupação excessiva e persistente com diferentes aspectos da vida, que afeta o dia a dia da pessoa.",
    "O que é um transtorno de pânico?": "O transtorno de pânico é caracterizado por ataques de pânico frequentes e inesperados, que envolvem medo intenso e sintomas físicos, como falta de ar e taquicardia.",
    "O que é o sono REM?": "O sono REM (Rapid Eye Movement) é uma fase do sono onde ocorrem sonhos e o cérebro se torna mais ativo, com movimentos rápidos dos olhos.",
    "Como melhorar o sono?": "Para melhorar o sono, é importante manter uma rotina regular, evitar cafeína à noite e criar um ambiente tranquilo e confortável.",
    "O que é a psicologia?": "A psicologia é a ciência que estuda o comportamento humano e os processos mentais, como pensamentos, emoções e percepções.",
    "O que é a meditação?": "Meditação é uma prática de concentração e relaxamento que visa acalmar a mente e reduzir o estresse.",
    "O que são emoções?": "Emoções são respostas psicológicas e fisiológicas a estímulos externos, que podem afetar o comportamento, o pensamento e o estado de saúde mental.",
    "O que é a síndrome de burnout?": "A síndrome de burnout é um estado de exaustão extrema causado pelo estresse crônico relacionado ao trabalho, que pode levar a sentimentos de desânimo e falta de motivação.",
    "O que é a terapia ocupacional?": "A terapia ocupacional é um tipo de tratamento que ajuda as pessoas a desenvolverem ou recuperarem habilidades para realizar atividades diárias.",
    "Como melhorar a saúde mental?": "Para melhorar a saúde mental, é importante praticar atividades físicas, manter relações saudáveis, buscar ajuda profissional quando necessário e adotar hábitos saudáveis.",
    "O que é a psicoterapia?": "A psicoterapia é um tratamento para questões emocionais e psicológicas, que envolve conversas entre um paciente e um profissional da saúde mental.",
    "O que é a empatia?": "Empatia é a capacidade de compreender e compartilhar os sentimentos de outra pessoa, colocando-se no lugar dela.",
    "O que é a depressão pós-parto?": "A depressão pós-parto é um transtorno psicológico que afeta algumas mulheres após o nascimento do bebê, com sintomas de tristeza intensa, irritabilidade e cansaço extremo.",
    "O que são transtornos de personalidade?": "Transtornos de personalidade são padrões duradouros de pensamentos, comportamentos e emoções que são inflexíveis e causam sofrimento significativo à pessoa ou aos outros.",
    "O que é a felicidade?": "Felicidade é um estado emocional positivo, de satisfação e contentamento com a vida, que pode ser influenciado por fatores internos e externos.",
    "O que é a síndrome do impostor?": "A síndrome do impostor é um fenômeno psicológico onde uma pessoa duvida de suas habilidades e tem medo de ser 'desmascarada', mesmo tendo sucesso.",
    "O que é um transtorno obsessivo-compulsivo (TOC)?": "O transtorno obsessivo-compulsivo (TOC) é um distúrbio mental caracterizado por obsessões (pensamentos intrusivos) e compulsões (comportamentos repetitivos).",
    "O que é o transtorno de estresse pós-traumático (TEPT)?": "O transtorno de estresse pós-traumático (TEPT) é uma condição mental que pode ocorrer após a pessoa vivenciar ou testemunhar eventos traumáticos.",
    "O que é a psicologia positiva?": "A psicologia positiva é uma abordagem da psicologia que foca no estudo de aspectos positivos da experiência humana, como felicidade, gratidão e bem-estar.",
    "O que é o autocuidado?": "Autocuidado é a prática de atividades que promovem o bem-estar físico, mental e emocional, como alimentação saudável, exercícios e descanso.",
    "O que são fobias?": "Fobias são medos intensos e irracionais de objetos, situações ou atividades específicas, que podem interferir no funcionamento normal da vida.",
    "O que é o transtorno bipolar?": "O transtorno bipolar é um transtorno mental caracterizado por mudanças extremas de humor, alternando entre períodos de depressão e mania.",
    "O que é um ataque de pânico?": "Um ataque de pânico é uma sensação repentina de medo ou desconforto intenso, que pode incluir sintomas físicos como falta de ar, taquicardia e tremores.",
    "O que é o transtorno de déficit de atenção e hiperatividade (TDAH)?": "O transtorno de déficit de atenção e hiperatividade (TDAH) é uma condição neuropsiquiátrica caracterizada por dificuldades de concentração, impulsividade e hiperatividade.",
    "Como reduzir a ansiedade?": "Algumas formas de reduzir a ansiedade incluem a prática de relaxamento, meditação, respiração profunda e a busca de apoio psicológico.",
    "O que é o burnout?": "Burnout é um estado de exaustão física e emocional causada pelo estresse prolongado, especialmente no ambiente de trabalho.",
    "O que são as drogas psicoativas?": "Drogas psicoativas são substâncias que alteram o funcionamento do cérebro, afetando a percepção, humor e comportamento da pessoa.",
    "O que é a psicologia do desenvolvimento?": "A psicologia do desenvolvimento estuda as mudanças comportamentais e cognitivas ao longo da vida, desde a infância até a velhice.",
    "O que é a neurociência?": "Neurociência é o campo da ciência que estuda o cérebro e o sistema nervoso, investigando como eles influenciam o comportamento e os processos mentais.",
    "O que é a síndrome de Down?": "A síndrome de Down é uma condição genética que causa deficiência intelectual e outros desafios de desenvolvimento, devido à presença de um cromossomo extra.",
    "O que é a terapia de casal?": "A terapia de casal é um tipo de psicoterapia que visa resolver conflitos e melhorar a comunicação e os relacionamentos entre parceiros.",
    "Como a atividade física afeta a saúde mental?": "A atividade física regular pode melhorar a saúde mental, reduzindo os níveis de estresse, ansiedade e depressão, e promovendo o bem-estar geral.",
    "O que é a psicologia clínica?": "A psicologia clínica é a área da psicologia que trata de doenças e distúrbios mentais, utilizando diferentes abordagens terapêuticas.",
    "O que são os transtornos de humor?": "Transtornos de humor são condições psicológicas que envolvem alterações significativas no estado emocional, como depressão e transtorno bipolar.",
    "O que é um terapeuta?": "Um terapeuta é um profissional de saúde mental que oferece apoio e tratamento psicológico para ajudar as pessoas a superar dificuldades emocionais e comportamentais.",
    "O que é a ansiedade social?": "A ansiedade social é o medo excessivo de ser julgado ou humilhado em situações sociais, o que pode afetar a interação com outras pessoas.",
    "O que é a síndrome de Tourette?": "A síndrome de Tourette é um transtorno neurológico caracterizado por tiques motores e vocais involuntários.",
    "O que é o transtorno de personalidade borderline?": "O transtorno de personalidade borderline é um distúrbio psicológico caracterizado por instabilidade emocional, relacionamentos intensos e comportamentos impulsivos.",
    "O que são as terapias alternativas?": "Terapias alternativas são tratamentos não convencionais que incluem práticas como acupuntura, aromaterapia e homeopatia, usadas para melhorar o bem-estar físico e mental.",
    "O que é a psicanálise?": "A psicanálise é uma abordagem terapêutica desenvolvida por Sigmund Freud que busca compreender os processos inconscientes e suas influências no comportamento.",
    "Como a música pode beneficiar a saúde mental?": "A música pode ter efeitos terapêuticos, ajudando a aliviar o estresse, melhorar o humor e promover relaxamento.",
    "O que é a psicologia social?": "A psicologia social estuda como as pessoas são influenciadas pelos outros, incluindo temas como conformidade, preconceito e relações interpessoais.",
    "O que é a transtorno de adaptação?": "O transtorno de adaptação é uma condição psicológica em que uma pessoa tem dificuldade de lidar com mudanças significativas na vida, resultando em sintomas como ansiedade e depressão.",
    "Como o estresse afeta o corpo?": "O estresse prolongado pode afetar o corpo, causando problemas como aumento da pressão arterial, problemas cardíacos e enfraquecimento do sistema imunológico.",
    "O que é futurologia?": "A futurologia é o estudo e a previsão do futuro, com base em tendências atuais e projeções de desenvolvimentos tecnológicos, sociais e econômicos.",
    "Como a inteligência artificial pode impactar o futuro do trabalho?": "A inteligência artificial pode automatizar tarefas repetitivas, criando novas oportunidades para cargos mais criativos e estratégicos, mas também pode levar à eliminação de alguns empregos.",
    "O que são cidades inteligentes?": "Cidades inteligentes são aquelas que utilizam a tecnologia para melhorar a infraestrutura, os serviços públicos e a qualidade de vida dos seus habitantes, por meio de sistemas integrados e conectados.",
    "Como as mudanças climáticas podem afetar o futuro da Terra?": "As mudanças climáticas podem causar desastres naturais mais frequentes, elevação do nível do mar e perda de biodiversidade, afetando diretamente a vida no planeta.",
    "O que são energias renováveis?": "Energias renováveis são fontes de energia que se renovam naturalmente, como a solar, eólica, hídrica e geotérmica, e são fundamentais para um futuro sustentável.",
    "Qual o impacto da tecnologia no comportamento humano?": "A tecnologia tem modificado o comportamento humano, acelerando a comunicação e o acesso à informação, mas também gerando dependência e afetando a interação face a face.",
    "O que são criptomoedas e qual seu futuro?": "Criptomoedas são moedas digitais descentralizadas, baseadas em tecnologia blockchain, e seu futuro pode incluir uma maior adoção como alternativa ao sistema bancário tradicional.",
    "Como as viagens espaciais podem evoluir no futuro?": "As viagens espaciais podem se tornar mais acessíveis, com o turismo espacial em expansão e a exploração de outros planetas, como Marte, como objetivos viáveis para a humanidade.",
    "O que é a singularidade tecnológica?": "A singularidade tecnológica é um ponto hipotético no futuro onde a inteligência artificial supera a inteligência humana, levando a mudanças imprevisíveis e rápidas na sociedade.",
    "Qual o impacto das redes sociais na sociedade atual?": "As redes sociais têm um grande impacto na sociedade, tanto positivo quanto negativo, ao facilitar a comunicação e o acesso à informação, mas também geram problemas como a disseminação de fake news e a polarização.",
    "O que são tecnologias emergentes?": "Tecnologias emergentes são inovações que estão em fase inicial de desenvolvimento, mas que têm o potencial de transformar setores inteiros, como inteligência artificial, biotecnologia e nanotecnologia.",
    "Como a medicina pode evoluir nos próximos anos?": "A medicina pode evoluir com o uso de tecnologias como a edição genética, terapias personalizadas e inteligência artificial para diagnóstico e tratamento de doenças.",
    "O que é a economia digital?": "A economia digital é a economia baseada na tecnologia da informação e comunicação, incluindo o comércio eletrônico, criptomoedas e plataformas digitais.",
    "Como as mudanças sociais podem impactar o futuro?": "As mudanças sociais, como o aumento da igualdade de gênero e o avanço das questões ambientais, podem transformar os valores e as estruturas sociais no futuro, promovendo um mundo mais inclusivo e sustentável.",
    "O que é a realidade aumentada?": "A realidade aumentada é uma tecnologia que sobrepõe informações digitais ao mundo real, oferecendo novas formas de interação com o ambiente e criando experiências imersivas.",
    "Como a educação pode ser impactada pela tecnologia no futuro?": "A educação pode ser transformada por tecnologias como o ensino a distância, inteligência artificial e plataformas digitais, tornando o aprendizado mais acessível e personalizado.",
    "O que é o conceito de transumanismo?": "O transumanismo é um movimento filosófico e científico que acredita na melhoria das capacidades humanas através do uso de tecnologias avançadas, como implantes cibernéticos e inteligência artificial.",
    "Como o consumo de energia pode mudar no futuro?": "O consumo de energia pode mudar com a adoção em massa de fontes renováveis e tecnologias mais eficientes, além de um aumento na conscientização sobre a sustentabilidade.",
    "Como as pessoas podem se preparar para o futuro em termos de habilidades?": "As pessoas podem se preparar para o futuro adquirindo habilidades como adaptabilidade, pensamento crítico, e conhecimentos em áreas tecnológicas como programação e análise de dados.",
    "Qual é a comida típica do Brasil?": "A comida típica do Brasil inclui feijoada, arroz e feijão, churrasco, e o pão de queijo.",
    "O que é o carnaval no Brasil?": "O carnaval no Brasil é uma festa popular, famosa por suas danças, desfiles de escolas de samba e festas de rua.",
    "O que é a Oktoberfest na Alemanha?": "A Oktoberfest é uma famosa festa de cerveja realizada anualmente em Munique, na Alemanha, com muita música, comida e, claro, cerveja.",
    "Quais são as tradições do Japão?": "No Japão, algumas tradições incluem a cerimônia do chá, festivais como o Hanami (observação das flores de cerejeira) e a prática do origami.",
    "O que é a dança flamenca na Espanha?": "A dança flamenca é uma tradicional forma de dança e música da Andaluzia, no sul da Espanha, caracterizada por movimentos intensos e expressivos.",
    "Como é comemorado o Natal nos Estados Unidos?": "Nos Estados Unidos, o Natal é comemorado com decorações de Natal, troca de presentes e grandes jantares familiares.",
    "Qual é a comida típica da Itália?": "A comida típica da Itália inclui pizza, pasta (massa), risoto e gelato.",
    "O que é o Dia dos Mortos no México?": "O Dia dos Mortos é uma celebração mexicana em que se homenageiam os ancestrais falecidos com altares, comida, flores e velas.",
    "O que é o sushi no Japão?": "O sushi é um prato tradicional japonês feito com arroz temperado, peixe cru e outros ingredientes como algas e vegetais.",
    "Quais são as tradições de casamento na Índia?": "Na Índia, os casamentos tradicionais costumam ser grandiosos e incluem rituais como o 'sindoor', troca de guirlandas e o 'saptapadi' (sete passos ao redor do fogo).",
    "O que é o chá da tarde na Inglaterra?": "O chá da tarde é uma tradição inglesa, onde as pessoas se reúnem para beber chá acompanhado de sanduíches, bolos e biscoitos.",
    "O que são os tapas na Espanha?": "Tapas são pequenos pratos de comida servidos como aperitivos ou petiscos, comuns na Espanha, e podem incluir desde azeitonas até pratos mais elaborados.",
    "O que é a dança do ventre no Egito?": "A dança do ventre é uma dança tradicional do Oriente Médio, com movimentos fluidos e sensuais, originária do Egito.",
    "Como é a comida típica da França?": "A comida típica da França inclui baguetes, queijos, vinhos, croissants e pratos como escargot e coq au vin.",
    "Quais são as principais festas tradicionais na China?": "Na China, festas tradicionais incluem o Ano Novo Chinês, o Festival da Lua e o Festival Qingming, que envolvem rituais e celebrações familiares.",
    "O que é a festa Junina no Brasil?": "A festa Junina no Brasil é uma celebração tradicional, marcada por danças típicas como quadrilha, comidas como pamonha e quentão, e roupas caipiras.",
    "Como é a tradição de Ano Novo na Escócia?": "Na Escócia, o Ano Novo é comemorado com a festa de Hogmanay, que inclui fogos de artifício, música e o famoso 'first-footing' (primeiro visitante).",
    "Quais são os pratos tradicionais da Grécia?": "Na Grécia, pratos tradicionais incluem moussaka, souvlaki, tzatziki e baklava.",
    "O que é o tango na Argentina?": "O tango é uma dança tradicional argentina, caracterizada por movimentos sensuais e dramáticos, com forte presença musical.",
    "Quais são as principais festas no Brasil?": "As principais festas no Brasil incluem o Carnaval, Festa Junina e o Réveillon, com muita música, danças e comidas típicas.",
    "Como é a culinária de Portugal?": "A culinária portuguesa é famosa pelo bacalhau, pastéis de nata, cozido à portuguesa e vinho do Porto.",
    "O que é a dança do fado em Portugal?": "O fado é uma música tradicional de Portugal, com letras melancólicas, acompanhada por guitarra portuguesa, e é frequentemente performado em cafés e casas de fado.",
    "O que é a Capoeira no Brasil?": "A Capoeira é uma arte marcial e dança originária do Brasil, com movimentos acrobáticos, samba e influências africanas.",
    "O que são os mercados de Natal na Alemanha?": "Os mercados de Natal na Alemanha são feiras tradicionais que ocorrem durante o Advento, vendendo produtos artesanais, comidas típicas e bebidas quentes.",
    "Como é a comida típica da Turquia?": "A comida típica da Turquia inclui kebabs, baklava, meze (aperitivos), e o famoso café turco.",
    "O que é a dança tradicional do Brasil chamada frevo?": "O frevo é um tipo de dança e música tradicional do Brasil, caracterizada por movimentos rápidos e acrobáticos, originária de Pernambuco.",
    "O que são as cerejeiras no Japão?": "As cerejeiras no Japão são simbólicas, e sua florada (Hanami) é celebrada com festivais e piqueniques, marcando o início da primavera.",
    "O que é a culinária tailandesa?": "A culinária tailandesa é famosa por seu equilíbrio entre sabores de doce, salgado, ácido e picante, com pratos como pad thai, curry e tom yum.",
    "Qual é a principal bebida no Brasil?": "A principal bebida no Brasil é o café, consumido de várias formas, mas a caipirinha, feita com cachaça, também é bastante popular.",
    "Como é a comida tradicional da Rússia?": "A comida tradicional russa inclui pratos como borscht (sopa de beterraba), caviar, blinis e pirozhki (pastéis recheados).",
    "O que são os carnavais em Trinidad e Tobago?": "O Carnaval de Trinidad e Tobago é uma grande festa cultural, com desfiles de fantasias coloridas, música calipso e soca, e danças vibrantes.",
    "Quais são as tradições de Natal na Alemanha?": "Na Alemanha, o Natal é comemorado com mercados de Natal, a ceia de Natal com ganso assado, e a tradição de abrir os calendários do Advento.",
    "O que é o Carnaval de Veneza?": "O Carnaval de Veneza é famoso por seus elaborados trajes e máscaras, onde as pessoas se reúnem para dançar e celebrar nas ruas e canais de Veneza.",
    "Quais são as tradições de casamento na Escócia?": "Na Escócia, o casamento tradicional pode incluir a cerimônia de troca de votos, o 'Scottish ceilidh' (dança tradicional) e o 'Handfasting', onde as mãos do casal são unidas com uma fita.",
    "Qual é a comida tradicional da Inglaterra?": "A comida tradicional da Inglaterra inclui fish and chips, Yorkshire pudding, roast beef e chá da tarde.",
    "Quais são as principais festas na França?": "Na França, as principais festas incluem o Bastille Day (Dia da Bastilha), o Carnaval de Nice e a celebração de Natal com mercados e festas familiares.",
    "Qual é o principal esporte na Austrália?": "O principal esporte na Austrália é o críquete, seguido por outros esportes populares como o futebol australiano e o rugby.",
    "O que é o Dia da Bastilha na França?": "O Dia da Bastilha, comemorado em 14 de julho, marca a queda da Bastilha e a Revolução Francesa, sendo celebrado com desfiles, festas e fogos de artifício.",
    "Como é a culinária da Índia?": "A culinária da Índia é rica em especiarias, com pratos como curry, biryani, samosas e naan, e cada região tem suas próprias especialidades.",
    "O que é a dança Kathakali na Índia?": "Kathakali é uma dança tradicional de Kerala, na Índia, caracterizada por movimentos de mãos e expressões faciais intensas, contando histórias épicas da mitologia hindu.",
    "Como os franceses comemoram o Ano Novo?": "Os franceses comemoram o Ano Novo com grandes festas, jantares em família e com a tradicional 'galette des rois', um bolo de Ano Novo.",
    "Quais são as tradições de casamento no Japão?": "No Japão, os casamentos tradicionais incluem cerimônias no templo xintoísta, onde o casal realiza rituais simbólicos como beber sake e trocar votos.",
    "O que é a comida típica da Etiópia?": "A comida típica da Etiópia inclui injera (pão fermentado) acompanhado de pratos como doro wat (frango com molho picante) e legumes temperados.",
    "O que é a festa de Diwali na Índia?": "Diwali é o Festival das Luzes, uma das maiores celebrações religiosas na Índia, marcando a vitória da luz sobre a escuridão e do bem sobre o mal, com muitas luzes, fogos de artifício e doces.",
    "Qual é o principal prato típico da Argentina?": "O principal prato típico da Argentina é o asado, um tipo de churrasco, frequentemente acompanhado de vinho Malbec.",
    "O que é o futebol no Brasil?": "O futebol é o esporte mais popular no Brasil, sendo uma paixão nacional, com grandes equipes e jogadores reconhecidos mundialmente.",
    "O que são os carnavais na Colômbia?": "O Carnaval de Barranquilla, na Colômbia, é um dos maiores e mais importantes do país, com desfiles, danças e músicas típicas como cumbia e mapalé.",
    "Como é celebrada a Páscoa na Espanha?": "Na Espanha, a Páscoa é marcada por procissões religiosas e celebrações em diversas cidades, sendo a Semana Santa uma das maiores festividades do país.",
    "O que é o haka na Nova Zelândia?": "O haka é uma dança tradicional maori da Nova Zelândia, caracterizada por movimentos vigorosos, gritos e expressões faciais intensas, tradicionalmente realizada antes de batalhas.",
    "Qual é a bebida típica da Irlanda?": "A bebida típica da Irlanda é o whiskey irlandês, além da famosa cerveja Guinness, que é um ícone da cultura local.",
    "Como é a cultura do chá na China?": "Na China, o chá é uma parte essencial da vida cotidiana e é consumido de diversas formas, desde o chá verde até o chá de ervas, com uma rica tradição de cerimônias de chá.",
    "O que é o Festival de Cores na Índia?": "O Festival de Cores, ou Holi, é uma celebração hindu que marca o início da primavera, onde as pessoas se jogam tinta colorida e celebram com música e dança.",
    "O que é o rugby na Nova Zelândia?": "O rugby é o esporte mais popular na Nova Zelândia, com a seleção All Blacks sendo uma das mais bem-sucedidas e reconhecidas do mundo.",
    "Quais são as principais danças tradicionais no México?": "As principais danças tradicionais no México incluem o jarabe tapatío (dança do chapéu mexicano), e o danzón e o son jarocho, que são influenciados pelas culturas indígenas e espanholas.",
    "Como é comemorado o Ano Novo na Escócia?": "Na Escócia, o Ano Novo é comemorado com o Hogmanay, que inclui fogos de artifício, danças e a tradição do 'first-footing', onde o primeiro visitante da casa traz boa sorte.",
    "O que é o Mardi Gras nos Estados Unidos?": "O Mardi Gras é um famoso carnaval celebrado em Nova Orleans, EUA, com desfiles, festas, máscaras e muitas cores, marcado por grande exuberância e celebração.",
    "Como é a comida tradicional da Tailândia?": "A comida tailandesa é conhecida por sua combinação equilibrada de sabores: doce, salgado, ácido e picante. Pratos como o Pad Thai e o curry verde são muito populares.",
    "O que é o Carnaval de Salvador?": "O Carnaval de Salvador é uma das maiores festas de rua do mundo, com blocos de carnaval, trios elétricos e uma mistura de músicas como axé, samba e frevo.",
    "Como é a culinária do Vietnã?": "A culinária vietnamita é famosa por seus pratos leves e frescos, como o pho (sopa de macarrão) e o banh mi (sanduíche vietnamita).",
    "O que é o futebol americano nos Estados Unidos?": "O futebol americano é um dos esportes mais populares nos Estados Unidos, com a NFL sendo a principal liga e o Super Bowl, o evento esportivo mais assistido do país.",
    "Quais são os principais pratos típicos da África do Sul?": "Os principais pratos da África do Sul incluem bobotie (carne moída com ovos e especiarias), biltong (carne seca) e o famoso braai (churrasco sul-africano).",
    "Como é comemorado o Natal na Itália?": "O Natal na Itália é celebrado com grandes refeições em família, trocas de presentes e a tradicional 'cena della vigilia' (ceia de Natal), com pratos de peixe e doces como panettone.",
    "O que é o Día de los Muertos no México?": "O Día de los Muertos (Dia dos Mortos) é uma celebração mexicana dedicada a honrar os ancestrais falecidos, com altares, comida, flores e velas.",
    "O que é o conceito de 'savoir-vivre' na França?": "O 'savoir-vivre' é o conceito francês de saber viver, englobando as boas maneiras, a etiqueta e a apreciação da vida de uma forma refinada e elegante.",
    "Quais são as tradições de casamento no Brasil?": "No Brasil, os casamentos tradicionais incluem a troca de alianças, a dança da noiva e do noivo, e uma grande festa com muita música e comida.",
    "O que é o reggae na Jamaica?": "O reggae é um gênero musical originado na Jamaica, conhecido por seus ritmos lentos e suas letras engajadas, com Bob Marley sendo o maior ícone do estilo.",
    "Como os finlandeses celebram o Natal?": "Na Finlândia, o Natal é comemorado com uma grande refeição, a visita à sauna e a tradição de ouvir a declaração do Natal do presidente.",
    "O que são as danças tradicionais na Polônia?": "As danças tradicionais da Polônia incluem a mazurka e a polonesa, que são danças folclóricas com origens na nobreza e no campo.",
    "O que é o K-pop na Coreia do Sul?": "O K-pop é um gênero musical originado na Coreia do Sul, conhecido por suas coreografias elaboradas, visuais impactantes e grupos de idols jovens e talentosos.",
    "Como é a comida típica da Suécia?": "A comida típica da Suécia inclui pratos como almôndegas suecas (köttbullar), arenque em conserva e pão de gengibre, especialmente popular no Natal.",
    "O que é o futebol na Inglaterra?": "O futebol é o esporte mais popular na Inglaterra, com a Premier League sendo uma das ligas mais famosas e disputadas do mundo.",
    "Como os japoneses comemoram o Hanami?": "O Hanami é a celebração da florada das cerejeiras no Japão, com piqueniques e festivais em parques onde as pessoas observam as flores e celebram a chegada da primavera.",
    "Qual é a comida típica da Rússia?": "A comida típica da Rússia inclui pratos como borscht (sopa de beterraba), caviar, blinis (panquecas) e pirozhki (pastéis recheados).",
    "Como é a comida típica da África?": "A comida africana varia por região, mas inclui pratos como o jollof rice na Nigéria, o cuscuz no norte da África, e pratos com milho e feijão.",
    "Quais são as festas típicas no Chile?": "No Chile, festas tradicionais incluem o Fiestas Patrias, que celebra a independência, com desfiles, danças e pratos típicos como empanadas e asados.",
    "O que é o samba no Brasil?": "O samba é uma das danças mais tradicionais do Brasil, com origens afro-brasileiras, e é a principal expressão cultural do Carnaval brasileiro.",
    "Como é a culinária da Espanha?": "A culinária espanhola é rica e variada, com pratos como paella, gazpacho, tapas e churros, e é influenciada pelas diversas regiões do país.",
    "O que foi a Primeira Guerra Mundial?": "A Primeira Guerra Mundial foi um conflito militar que ocorreu entre 1914 e 1918, envolvendo as principais potências europeias e resultando em grandes mudanças políticas e sociais.",
    "Quais países estavam envolvidos na Primeira Guerra Mundial?": "Os principais países envolvidos foram os Aliados (França, Reino Unido, Rússia, Itália, entre outros) e as Potências Centrais (Alemanha, Império Austro-Húngaro, Império Otomano, entre outros).",
    "Quem foi o estopim da Primeira Guerra Mundial?": "O assassinato do arquiduque Francisco Ferdinando da Áustria, em Sarajevo, em junho de 1914, é considerado o estopim do conflito.",
    "Onde a Primeira Guerra Mundial aconteceu?": "A maior parte dos combates ocorreu na Europa, mas o conflito também afetou regiões como o Oriente Médio, África e Oceania.",
    "Quando a Primeira Guerra Mundial terminou?": "A Primeira Guerra Mundial terminou em 11 de novembro de 1918, com a assinatura do armistício entre as potências beligerantes.",
    "Quais foram as principais batalhas da Primeira Guerra Mundial?": "Algumas das principais batalhas foram a Batalha do Somme, a Batalha de Verdun e a Batalha de Gallipoli.",
    "O que foi a Trincheira na Primeira Guerra Mundial?": "A trincheira foi uma rede de fossos escavados usados para proteção dos soldados durante os combates, especialmente na Frente Ocidental.",
    "Quais foram as consequências da Primeira Guerra Mundial?": "A guerra resultou em milhões de mortes, destruição econômica e social, e mudanças no mapa político da Europa, com a queda de impérios como o Austro-Húngaro e o Otomano.",
    "Quem eram os líderes das potências centrais?": "Os líderes das potências centrais eram o Kaiser Guilherme II, da Alemanha, e o Imperador Francisco José I, do Império Austro-Húngaro.",
    "Quem eram os líderes dos aliados?": "Os líderes dos aliados incluíam Georges Clemenceau, da França, David Lloyd George, do Reino Unido, e Woodrow Wilson, dos Estados Unidos.",
    "O que foi o Tratado de Versalhes?": "O Tratado de Versalhes, assinado em 1919, foi o acordo de paz que pôs fim à Primeira Guerra Mundial, impondo pesadas penalidades à Alemanha.",
    "Qual foi o impacto do uso de armas químicas na Primeira Guerra Mundial?": "O uso de armas químicas, como o gás mostarda, causou grandes sofrimentos aos soldados e civis, além de ser uma das inovações mais temidas do conflito.",
    "O que foi a guerra de trincheiras?": "A guerra de trincheiras foi uma forma de combate em que os soldados se abrigavam em redes de trincheiras, resultando em um impasse durante grande parte do conflito.",
    "Como os aviões foram usados na Primeira Guerra Mundial?": "Os aviões foram usados inicialmente para reconhecimento, mas logo passaram a ser usados em combate aéreo e bombardeios.",
    "O que é a Frente Ocidental?": "A Frente Ocidental foi a linha de combate entre os exércitos aliados e as potências centrais, principalmente na França e Bélgica, sendo caracterizada pela guerra de trincheiras.",
    "O que foi a Batalha de Verdun?": "A Batalha de Verdun, travada entre franceses e alemães, foi uma das batalhas mais longas e sangrentas da Primeira Guerra Mundial, com grandes perdas de ambos os lados.",
    "O que foi a Batalha do Somme?": "A Batalha do Somme foi uma das maiores ofensivas aliadas, que visava aliviar a pressão sobre a França e quebrar as defesas alemãs, mas resultou em pesadas baixas.",
    "Qual foi a importância da Revolução Russa durante a Primeira Guerra Mundial?": "A Revolução Russa de 1917 levou à retirada da Rússia da guerra, o que teve um impacto significativo no desenrolar do conflito.",
    "Como a entrada dos Estados Unidos afetou a Primeira Guerra Mundial?": "A entrada dos Estados Unidos em 1917 forneceu um reforço crucial às forças aliadas, ajudando a mudar o equilíbrio de poder e acelerar o fim da guerra.",
    "Qual foi o papel das mulheres na Primeira Guerra Mundial?": "Durante a Primeira Guerra Mundial, muitas mulheres trabalharam em fábricas, hospitais e até serviram nas forças armadas, desempenhando papéis cruciais no apoio à guerra.",
    "O que foi a diplomacia de guerra na Primeira Guerra Mundial?": "A diplomacia de guerra envolveu alianças políticas, negociações e tratados entre as potências beligerantes, com a intenção de garantir vitórias e alcançar objetivos políticos.",
    "O que foi a Batalha de Gallipoli?": "A Batalha de Gallipoli foi uma ofensiva militar aliada contra o Império Otomano, ocorrida em 1915, na península de Gallipoli, na Turquia, que terminou em derrota para os aliados.",
    "O que foi a Revolução Alemã de 1918?": "A Revolução Alemã de 1918 levou à abdicação do Kaiser Guilherme II, ao fim do Império Alemão e à criação da República de Weimar, após a derrota na Primeira Guerra Mundial.",
    "Qual foi o papel do submarino na Primeira Guerra Mundial?": "Os submarinos, especialmente os alemães (U-boats), foram usados para bloquear portos e atacar navios mercantes, causando grandes perdas no comércio internacional.",
    "O que foi a Frente Oriental?": "A Frente Oriental foi o teatro de guerra entre a Alemanha e o Império Austro-Húngaro contra o Império Russo, principalmente na região do leste da Europa.",
    "O que foi o Plano Schlieffen?": "O Plano Schlieffen foi uma estratégia militar alemã para evitar uma guerra em duas frentes, atacando rapidamente a França antes de enfrentar a Rússia, mas falhou quando as forças alemãs foram derrotadas na Frente Ocidental.",
    "Quem foi Franz Ferdinand?": "O arquiduque Franz Ferdinand foi o herdeiro do trono austro-húngaro, cujo assassinato em 1914, em Sarajevo, foi o estopim para o início da Primeira Guerra Mundial.",
    "Como a guerra afetou a economia mundial?": "A Primeira Guerra Mundial causou uma enorme crise econômica global, com grandes dívidas, inflação e destruição das infraestruturas de muitos países.",
    "O que foi a Liga das Nações?": "A Liga das Nações foi uma organização internacional criada após a Primeira Guerra Mundial com o objetivo de manter a paz, embora tenha falhado em evitar a Segunda Guerra Mundial.",
    "O que é o Armistício de 11 de novembro de 1918?": "O Armistício de 11 de novembro de 1918 foi o acordo que pôs fim às hostilidades da Primeira Guerra Mundial, com a Alemanha aceitando os termos aliados.",
    "Como a propaganda foi utilizada na Primeira Guerra Mundial?": "A propaganda foi amplamente utilizada para estimular o patriotismo, recrutar soldados, levantar fundos e demonizar o inimigo durante a Primeira Guerra Mundial.",
    "O que foram os Campos de Concentração na Primeira Guerra Mundial?": "Os campos de concentração foram usados principalmente pelo Império Otomano e pelos alemães para internar prisioneiros de guerra, civis e minorias étnicas durante o conflito.",
    "Qual a relação da Primeira Guerra Mundial com a Segunda Guerra Mundial?": "A Primeira Guerra Mundial criou as condições políticas e econômicas que, entre outras causas, levaram à ascensão do nazismo e, consequentemente, à Segunda Guerra Mundial.",
    "O que foi o Império Austro-Húngaro?": "O Império Austro-Húngaro foi uma monarquia dual na Europa Central que colapsou após a derrota na Primeira Guerra Mundial, dividindo-se em vários novos estados.",
    "Como os soldados lidavam com o estresse de combate na Primeira Guerra Mundial?": "O estresse de combate era uma grande preocupação, levando muitos soldados a desenvolverem o que hoje é conhecido como transtorno de estresse pós-traumático (TEPT).",
    "Qual foi o impacto da Primeira Guerra Mundial na ciência e na tecnologia?": "A Primeira Guerra Mundial acelerou o desenvolvimento de novas tecnologias, incluindo aviões, tanques, armas químicas e medicina de guerra.",
    "O que é a Frente Interna na Primeira Guerra Mundial?": "A Frente Interna se refere ao esforço de guerra nos países envolvidos, incluindo a produção de armas, a mobilização de recursos e o apoio ao esforço de combate.",
    "O que foi o Tratado de Brest-Litovsk?": "O Tratado de Brest-Litovsk, assinado em 1918, foi um acordo de paz entre a Rússia Soviética e as Potências Centrais, retirando a Rússia da Primeira Guerra Mundial.",
    "Quem foi Woodrow Wilson?": "Woodrow Wilson foi o presidente dos Estados Unidos durante a Primeira Guerra Mundial, e teve um papel importante na elaboração do Tratado de Versalhes e na criação da Liga das Nações.",
    "Como a Primeira Guerra Mundial afetou as colônias europeias?": "As colônias europeias foram afetadas pela mobilização de suas populações e recursos para a guerra, e muitas delas, como as na África, sofreram com a exploração e destruição.",
    "O que aconteceu com a Alemanha após a Primeira Guerra Mundial?": "Após a Primeira Guerra Mundial, a Alemanha perdeu territórios, foi obrigada a pagar pesadas indenizações e teve seu governo substituído pela República de Weimar.",
    "O que era o Império Otomano na Primeira Guerra Mundial?": "O Império Otomano foi uma das Potências Centrais, lutando ao lado da Alemanha e do Império Austro-Húngaro durante a Primeira Guerra Mundial.",
    "O que foram as trincheiras na Primeira Guerra Mundial?": "As trincheiras eram buracos escavados no solo onde os soldados se abrigavam para se proteger do fogo inimigo, especialmente na Frente Ocidental.",
    "Quem foi o Marechal Foch?": "O Marechal Ferdinand Foch foi um comandante militar francês que desempenhou um papel crucial na vitória dos aliados, coordenando as forças aliadas na última fase da guerra.",
    "O que foi o bloqueio naval britânico?": "O bloqueio naval britânico foi uma estratégia usada para cortar o fornecimento de recursos essenciais à Alemanha, dificultando seu esforço de guerra e levando a escassez de alimentos e outros bens.",
    "Qual a importância do uso de tanques na Primeira Guerra Mundial?": "Os tanques foram usados pela primeira vez na Primeira Guerra Mundial para romper as linhas inimigas e superar os obstáculos das trincheiras, mas sua eficácia foi limitada no início.",
    "Como a Primeira Guerra Mundial impactou a arte e a literatura?": "A Primeira Guerra Mundial gerou uma mudança cultural significativa, com escritores e artistas expressando os horrores da guerra em movimentos como o modernismo e o expressionismo.",
    "Qual foi o papel da Rússia na Primeira Guerra Mundial?": "A Rússia lutou ao lado dos aliados contra as Potências Centrais até 1917, quando a Revolução Russa levou à retirada do país do conflito.",
    "O que foi a Batalha de Ypres?": "A Batalha de Ypres foi uma série de batalhas travadas na Bélgica, onde o gás mostarda foi utilizado pela primeira vez em combate.",
    "Como a Primeira Guerra Mundial afetou a população civil?": "A população civil sofreu com bombardeios, escassez de alimentos, doenças e a perda de muitos jovens que foram chamados para o front.",
    "Quais inovações tecnológicas surgiram na Primeira Guerra Mundial?": "Inovações como o uso de aviões de combate, tanques, submarinos e armas químicas marcaram a Primeira Guerra Mundial, mudando a forma como as guerras seriam travadas no futuro.",
    "O que foi a Batalha de Tannenberg?": "A Batalha de Tannenberg foi uma grande vitória alemã contra o Exército Russo, em 1914, que ajudou a enfraquecer as forças russas no início da guerra.",
    "Quem foi Lawrence da Arábia?": "Thomas Edward Lawrence, conhecido como Lawrence da Arábia, foi um oficial britânico que liderou a Revolta Árabe contra o Império Otomano durante a Primeira Guerra Mundial.",
    "Como a Primeira Guerra Mundial afetou o Oriente Médio?": "A Primeira Guerra Mundial resultou no colapso do Império Otomano e levou à divisão de seus territórios entre as potências europeias, mudando o mapa do Oriente Médio.",
    "O que foi a Batalha de Jutlândia?": "A Batalha de Jutlândia foi uma grande batalha naval entre a Marinha Real Britânica e a Marinha Imperial Alemã, ocorrida em 1916, sendo a maior batalha naval da guerra.",
    "O que foi a Ofensiva da Primavera?": "A Ofensiva da Primavera foi uma série de ataques lançados pelos alemães em 1918 para tentar vencer a guerra antes que os Estados Unidos se consolidassem no conflito.",
    "Qual foi o papel da Bélgica na Primeira Guerra Mundial?": "A Bélgica foi invadida pela Alemanha em 1914, o que causou a entrada do Reino Unido na guerra. A resistência belga também inspirou os aliados a combater as Potências Centrais.",
    "Como fazer arroz simples?": "Para fazer arroz simples, basta refogar uma xícara de arroz em óleo ou azeite por alguns minutos, adicionar duas xícaras de água, sal a gosto e deixar cozinhar até a água secar.",
    "Qual é a receita de bolo de chocolate?": "Para fazer bolo de chocolate, misture 1 xícara de açúcar, 1 xícara de farinha de trigo, 1/2 xícara de cacau em pó, 1 colher de fermento, 1/2 xícara de óleo, 2 ovos e 1 xícara de leite. Asse em forno pré-aquecido por 30-40 minutos.",
    "Como fazer uma omelete?": "Para uma omelete, bata dois ovos com sal e pimenta, despeje em uma frigideira quente untada, e adicione queijo, presunto ou vegetais a gosto. Dobre e sirva.",
    "Como fazer panquecas?": "Misture 1 xícara de farinha, 1 ovo, 1/2 xícara de leite, 1 colher de açúcar e uma pitada de sal. Cozinhe pequenas porções em uma frigideira quente até dourar dos dois lados.",
    "Como fazer uma salada de frutas?": "Pique frutas como maçã, banana, laranja, morango e manga. Misture tudo e, se desejar, acrescente um pouco de suco de laranja ou mel.",
    "Qual é a receita de pizza caseira?": "Misture 500g de farinha, 1 colher de fermento, 1 colher de açúcar, 1 colher de sal e 300ml de água. Modele a massa, deixe crescer e adicione molho de tomate, queijo e os recheios de sua preferência.",
    "Como fazer brigadeiro?": "Em uma panela, misture 1 lata de leite condensado, 1 colher de manteiga e 7 colheres de achocolatado. Cozinhe até o ponto de soltar do fundo da panela e enrole em bolinhas.",
    "Como fazer um suco natural de laranja?": "Basta espremer 4 laranjas, coar e adicionar 1 a 2 colheres de açúcar, se desejar. Sirva com gelo.",
    "Qual é a receita de macarrão à bolonhesa?": "Refogue carne moída com cebola e alho, adicione molho de tomate, sal e temperos. Cozinhe até o molho engrossar e sirva com macarrão de sua escolha.",
    "Como fazer pão caseiro?": "Misture 500g de farinha, 10g de fermento, 1 colher de açúcar, 1 colher de sal, 2 colheres de óleo e 300ml de água. Modele o pão, deixe crescer e asse por 30-40 minutos.",
    "Como fazer um estrogonofe de frango?": "Refogue peito de frango cortado em cubos, adicione creme de leite e ketchup, tempere a gosto e cozinhe até o frango ficar macio.",
    "Qual a receita de pudim de leite condensado?": "Misture 1 lata de leite condensado, 2 latas de leite comum e 3 ovos. Caramelize uma forma e asse em banho-maria por 1 hora.",
    "Como fazer batatas assadas?": "Corte batatas em cubos, tempere com azeite, sal, pimenta e ervas. Asse em forno médio por cerca de 40 minutos, mexendo ocasionalmente.",
    "Qual é a receita de lasanha?": "Alterne camadas de massa de lasanha, molho de carne ou frango, molho branco e queijo. Asse por 40 minutos até borbulhar.",
    "Como fazer um frango grelhado?": "Tempere o frango com sal, pimenta, alho e limão. Grelhe em uma frigideira quente até dourar e cozinhar por dentro.",
    "Como fazer bolo de cenoura?": "Bata 3 cenouras, 3 ovos, 1 xícara de óleo, 2 xícaras de açúcar, 2 xícaras de farinha e 1 colher de fermento. Asse por 40 minutos.",
    "Qual é a receita de arroz de forno?": "Misture arroz pronto com queijo, presunto, milho e molho de tomate. Coloque em uma assadeira e asse por 20 minutos até o queijo derreter.",
    "Como fazer caldinho de feijão?": "Cozinhe o feijão e bata no liquidificador. Refogue alho, cebola e bacon, adicione ao feijão batido, ajuste o tempero e sirva quente.",
    "Como fazer um wrap?": "Em uma tortilha de trigo, coloque frango grelhado, alface, tomate e molho. Enrole e corte ao meio.",
    "Qual a receita de quiche de alho-poró?": "Faça uma massa de torta, preencha com uma mistura de alho-poró refogado, ovos, creme de leite e queijo. Asse até dourar.",
    "Como fazer torta de frango?": "Para a torta de frango, refogue o frango desfiado com cebola, alho, milho e azeitonas. Prepare uma massa de torta e cubra o recheio. Asse até dourar.",
    "Qual a receita de macarrão de forno?": "Misture macarrão cozido com molho de tomate, queijo, presunto e carne moída. Coloque em uma assadeira, cubra com queijo e asse até dourar.",
    "Como fazer sopa de legumes?": "Cozinhe cenoura, batata, abóbora e outros legumes de sua escolha em água. Adicione sal, pimenta e, se preferir, bata no liquidificador.",
    "Como fazer arroz à grega?": "Misture arroz cozido com cenoura ralada, ervilhas, pimentão e passas. Tempere com sal, azeite e sirva como acompanhamento.",
    "Qual é a receita de coxinha?": "Faça um recheio com frango desfiado e requeijão, depois modele a massa de coxinha com a mistura e frite até dourar.",
    "Como fazer pão de queijo?": "Misture polvilho, queijo ralado, ovos, leite e manteiga. Modele em bolinhas e asse em forno pré-aquecido até dourar.",
    "Como fazer mousse de maracujá?": "Bata no liquidificador 1 lata de leite condensado, 1 lata de suco de maracujá e 1 lata de creme de leite. Coloque em taças e leve à geladeira por 3 horas.",
    "Qual a receita de arroz com pequi?": "Refogue cebola e alho, adicione o arroz, o pequi e a água. Cozinhe até o arroz ficar pronto e sirva.",
    "Como fazer purê de batata?": "Cozinhe as batatas e amasse. Misture com manteiga, creme de leite, sal e pimenta a gosto. Sirva quente.",
    "Como fazer carne de panela?": "Tempere a carne com sal, pimenta e alho. Cozinhe em uma panela de pressão com cenoura, batata e cebola até ficar bem macia.",
    "Qual é a receita de lasanha de berinjela?": "Intercale camadas de berinjela grelhada, molho de tomate, queijo e presunto. Asse por 30 minutos até dourar.",
    "Como fazer salmão grelhado?": "Tempere o salmão com limão, sal e pimenta. Grelhe em uma frigideira com um pouco de azeite até dourar dos dois lados.",
    "Como fazer fricassê de frango?": "Refogue o frango desfiado com cebola e alho. Misture com creme de leite e milho, coloque em uma assadeira e cubra com queijo. Asse até dourar.",
    "Qual é a receita de arroz com frango?": "Cozinhe o arroz e reserve. Refogue o frango com alho e cebola, depois misture ao arroz. Sirva com ervas frescas.",
    "Como fazer abobrinha recheada?": "Corte as abobrinhas ao meio, retire o miolo e recheie com carne moída ou arroz temperado. Asse até ficar macia.",
    "Como fazer purê de abóbora?": "Cozinhe a abóbora e amasse. Misture com manteiga, sal e um pouco de creme de leite. Sirva quente.",
    "Como fazer empadão de frango?": "Prepare uma massa de empada, recheie com frango desfiado e cebola. Cubra com mais massa e asse até dourar.",
    "Qual é a receita de crepe francês?": "Misture farinha, leite, ovos e manteiga para a massa. Cozinhe em uma frigideira quente, recheie com queijo e presunto, e dobre.",
    "Como fazer bolo de laranja?": "Bata no liquidificador 2 laranjas, 3 ovos, 1 xícara de açúcar e 1/2 xícara de óleo. Misture com 2 xícaras de farinha e 1 colher de fermento. Asse por 40 minutos.",
    "Qual a receita de torta de maçã?": "Faça uma massa de torta, recheie com maçãs fatiadas e açúcar. Cubra com mais massa e asse até dourar.",
    "Como fazer empanada de carne?": "Faça um recheio com carne moída refogada com cebola e alho. Modele a massa, recheie e frite ou asse até dourar.",
    "Qual a receita de risoto de camarão?": "Refogue cebola e alho, adicione arroz arbóreo e vá adicionando caldo de camarão até o arroz ficar cremoso. Finalize com camarões e queijo parmesão.",
    "Como fazer pão sírio?": "Misture farinha, fermento, sal e água até formar uma massa lisa. Modele os pães, deixe crescer e asse até dourar.",
    "Como fazer farofa?": "Refogue cebola, alho e bacon, depois adicione farinha de mandioca e misture bem. Sirva como acompanhamento.",
    "Qual é a receita de bolo de milho?": "Bata no liquidificador 2 espigas de milho, 1 xícara de leite, 1 xícara de açúcar, 2 ovos e 1 xícara de fubá. Asse por 30-40 minutos.",
    "Como fazer molho de tomate caseiro?": "Refogue cebola e alho, adicione tomates picados e cozinhe até virar um molho espesso. Tempere com sal, pimenta e manjericão.",
    "Como fazer sopa de cebola?": "Refogue cebola até dourar, adicione caldo de carne ou legumes e cozinhe até a cebola ficar bem macia. Sirva com torradas.",
    "Qual é a receita de frango assado?": "Tempere o frango com alho, cebola, limão, sal e pimenta. Asse em forno pré-aquecido até dourar e ficar bem cozido.",
    "Como fazer molho branco?": "Derreta manteiga em uma panela, adicione farinha e cozinhe até dourar. Acrescente leite aos poucos, mexendo até ficar cremoso. Tempere com sal e noz-moscada.",
    "Como fazer batata gratinada?": "Corte as batatas em rodelas finas, arrume em uma assadeira, cubra com molho branco, queijo e leve ao forno até dourar.",
    "Como fazer salada de macarrão?": "Cozinhe o macarrão, depois misture com legumes, presunto, queijo, maionese e tempere com sal, pimenta e azeite.",
    "Como fazer bolinho de arroz?": "Misture arroz cozido com ovos, queijo e temperos. Modele em bolinhas e frite até dourar.",
    "Qual é a receita de pizza de calabresa?": "Faça a massa de pizza, adicione molho de tomate, queijo, rodelas de calabresa e orégano. Asse até o queijo derreter.",
    "Como fazer cocada?": "Cozinhe 1 lata de leite condensado com 2 xícaras de coco ralado e açúcar até dar o ponto de cocada. Modele e deixe esfriar.",
    "Como fazer guacamole?": "Amasse 2 abacates maduros, adicione cebola roxa picada, coentro, suco de limão, sal e pimenta a gosto.",
    "Como fazer pudim de chocolate?": "Misture 1 lata de leite condensado, 1 lata de leite, 2 colheres de achocolatado e 3 ovos. Asse em banho-maria até firmar.",
    "Qual é a receita de torta de limão?": "Faça uma base de biscoito triturado com manteiga. Prepare um recheio com leite condensado, creme de leite e suco de limão. Cubra com chantilly e sirva gelado.",
    "Como fazer batata frita?": "Corte as batatas em tiras, frite em óleo quente até dourar e depois escorra em papel toalha. Tempere com sal.",
    "Como fazer strogonoff de carne?": "Refogue a carne cortada em tiras com cebola e alho. Adicione creme de leite e ketchup, misture e cozinhe até a carne ficar macia.",
    "Como fazer risoto de cogumelos?": "Refogue cebola e alho, adicione arroz arbóreo e vá adicionando caldo de legumes até o arroz cozinhar. Finalize com cogumelos e queijo parmesão.",
    "Como fazer feijão tropeiro?": "Cozinhe o feijão e reserve. Refogue bacon e linguiça, depois misture ao feijão. Adicione farinha de mandioca, alho e cebola frita. Sirva com arroz.",
    "Como fazer carne de sol com macaxeira?": "Cozinhe a carne de sol até ficar macia. Refogue cebola e alho, depois adicione a carne e macaxeira cozida. Sirva com arroz.",
    "Como fazer lasanha de carne?": "Monte camadas de massa de lasanha, molho de carne, molho branco e queijo. Repita as camadas e asse até dourar.",
    "Como fazer torta de frango cremosa?": "Recheie uma massa de torta com frango desfiado, requeijão e milho. Cubra com a massa e asse até dourar.",
    "Como fazer arroz de forno?": "Misture arroz cozido com presunto, queijo, molho de tomate e legumes. Coloque em uma assadeira e asse até o queijo derreter.",
    "Como fazer pavê de chocolate?": "Monte camadas de biscoitos, creme de chocolate e creme branco. Repita as camadas e leve à geladeira por 4 horas.",
    "Como fazer peito de frango grelhado?": "Tempere o peito de frango com sal, pimenta e limão. Grelhe até dourar dos dois lados.",
    "Como fazer bolinho de chuva?": "Misture farinha, leite, açúcar, ovos e fermento. Modele em bolinhas e frite até dourar. Passe no açúcar e canela.",
    "Como fazer camarão na moranga?": "Cozinhe o camarão com temperos, depois recheie uma abóbora moranga cozida e cubra com requeijão. Asse até dourar.",
    "Como fazer pastel de carne?": "Modele a massa de pastel, recheie com carne moída temperada e frite até ficar dourado.",
    "Como fazer pizza de muçarela?": "Prepare a massa, espalhe molho de tomate, queijo muçarela e orégano. Asse até o queijo derreter.",
    "Como fazer caldo verde?": "Refogue alho e cebola, adicione batatas cozidas, caldo de galinha e couve. Cozinhe até os sabores se misturarem.",
    "Como fazer arroz com linguiça?": "Refogue linguiça com cebola e alho. Adicione arroz e água, cozinhando até o arroz ficar pronto.",
    "Como fazer bolo de chocolate?": "Misture farinha, açúcar, achocolatado, ovos, leite e óleo. Adicione fermento e asse até firmar.",
    "Como fazer canjica?": "Cozinhe a canjica em água até amolecer, depois misture com leite condensado, leite e coco ralado. Cozinhe até engrossar.",
    "Como fazer sorvete caseiro?": "Bata creme de leite e leite condensado até ficar espesso. Misture frutas ou chocolate e leve ao congelador.",
    "Como fazer arroz doce?": "Cozinhe o arroz com leite, açúcar e canela até o arroz ficar macio e o creme engrossar. Sirva gelado ou morno.",
    "Qual é a paisagem mais famosa da África?": "A savana africana é uma paisagem icônica, com suas vastas planícies e vida selvagem abundante.",
    "Onde fica a maior floresta tropical do mundo?": "A Amazônia, localizada na América do Sul, é a maior floresta tropical do mundo.",
    "Quais são as principais montanhas da Ásia?": "O Himalaia, incluindo o Monte Everest, é uma das principais cadeias montanhosas da Ásia.",
    "Qual é o deserto mais extenso do planeta?": "O Deserto do Saara, na África, é o maior deserto quente do mundo.",
    "Onde está localizada a Grande Barreira de Coral?": "A Grande Barreira de Coral está localizada na costa nordeste da Austrália.",
    "Qual é o lago mais profundo do mundo?": "O Lago Baikal, na Rússia, é o mais profundo, com uma profundidade de cerca de 1.642 metros.",
    "Onde fica o maior vulcão do mundo?": "O Mauna Loa, no Havai, é o maior vulcão ativo do mundo.",
    "Qual é a paisagem mais característica da Nova Zelândia?": "A Nova Zelândia é famosa por suas paisagens montanhosas, lagos e campos verdes exuberantes.",
    "Onde fica o deserto mais frio do mundo?": "O Deserto de Gobi, na Mongólia, é o deserto mais frio do mundo.",
    "O que são as Ilhas Galápagos?": "As Ilhas Galápagos são um arquipélago famoso por sua biodiversidade única, localizado no Oceano Pacífico, ao largo do Equador.",
    "Qual é a paisagem típica do Canadá?": "O Canadá é conhecido por suas vastas florestas boreais, lagos cristalinos e as Montanhas Rochosas.",
    "Onde está localizada a tundra ártica?": "A tundra ártica cobre grandes partes do norte do Canadá, Alasca e Rússia.",
    "Onde está o Monte Kilimanjaro?": "O Monte Kilimanjaro está localizado na Tanzânia, na África, e é o ponto mais alto do continente.",
    "Onde fica o Parque Nacional Torres del Paine?": "O Parque Nacional Torres del Paine está localizado no Chile, na Patagônia, e é famoso por suas montanhas e lagos.",
    "Onde está a floresta de sequoias?": "As florestas de sequoias, com algumas das árvores mais altas do mundo, estão localizadas na Califórnia, EUA.",
    "Qual é a paisagem do deserto de Atacama?": "O Deserto de Atacama, no Chile, é uma das paisagens mais áridas do planeta, com dunas e formações rochosas únicas.",
    "Onde está localizada a região de fiordes na Noruega?": "A Noruega é famosa por seus fiordes, que são vales estreitos e profundos, geralmente preenchidos por água do mar.",
    "O que são as Terras Altas da Escócia?": "As Terras Altas da Escócia são conhecidas por suas paisagens montanhosas e vales profundos.",
    "Onde ficam as Montanhas Rochosas?": "As Montanhas Rochosas se estendem ao longo da América do Norte, desde o Canadá até os Estados Unidos.",
    "Qual é o maior cânion do mundo?": "O Cânion de Yarlung Tsangpo, no Tibete, é considerado o maior cânion do mundo, superando o Grand Canyon em profundidade.",
    "Onde ficam as Ilhas Maldivas?": "As Ilhas Maldivas estão localizadas no Oceano Índico, ao sudoeste da Índia e Sri Lanka, e são famosas por suas águas cristalinas e recifes de corais.",
    "O que são as Pampas?": "As Pampas são vastas planícies de grama localizadas na Argentina, Uruguai e Brasil, conhecidas por sua agricultura e criação de gado.",
    "Onde está o Parque Nacional de Yellowstone?": "O Parque Nacional de Yellowstone está localizado nos Estados Unidos, abrangendo os estados de Wyoming, Montana e Idaho.",
    "Qual é a paisagem típica da Islândia?": "A Islândia é famosa por suas paisagens vulcânicas, com gêiseres, fontes termais, geleiras e campos de lava.",
    "Onde fica a Floresta Negra?": "A Floresta Negra está localizada no sudoeste da Alemanha, famosa por sua vegetação densa e mitos folclóricos.",
    "Qual é o maior lago da África?": "O Lago Vitória é o maior lago da África, localizado entre a Tanzânia, Uganda e Quênia.",
    "Onde está a Baía de Halong?": "A Baía de Halong está localizada no norte do Vietnã, conhecida por suas impressionantes formações de calcário e águas turquesas.",
    "Onde fica o Parque Nacional Banff?": "O Parque Nacional Banff está localizado nas Montanhas Rochosas, na província de Alberta, no Canadá.",
    "Onde está o Deserto de Namíbia?": "O Deserto de Namíbia está na África Austral, conhecido por suas dunas de areia vermelha e pelo Parque Nacional Namib-Naukluft.",
    "O que é o Pantanal?": "O Pantanal é uma vasta região alagada, localizada no Brasil, Bolívia e Paraguai, famosa pela sua biodiversidade.",
    "Onde está a Grande Muralha da China?": "A Grande Muralha da China se estende por milhares de quilômetros ao norte do país, construída para proteção contra invasores.",
    "Onde fica o Monte Fuji?": "O Monte Fuji está localizado no Japão e é um dos vulcões mais icônicos do país.",
    "Onde está a Lagoa do Mundaú?": "A Lagoa do Mundaú está localizada em Maceió, Alagoas, Brasil, e é uma grande lagoa costeira.",
    "Onde está o Deserto de Kalahari?": "O Deserto de Kalahari é uma vasta região no sul da África, abrangendo Botsuana, Namíbia e África do Sul.",
    "Qual é a paisagem típica da Patagônia?": "A Patagônia é uma região no sul da América do Sul, famosa por suas montanhas, geleiras e vastas planícies.",
    "Onde ficam as Cavernas de Waitomo?": "As Cavernas de Waitomo estão localizadas na Nova Zelândia, conhecidas por suas impressionantes formações de estalactites e as larvas bioluminescentes.",
    "Onde estão os Lagos de Plitvice?": "Os Lagos de Plitvice estão localizados na Croácia, um parque nacional famoso por suas cascatas e águas cristalinas.",
    "Onde está o Parque Nacional de Torres del Paine?": "O Parque Nacional Torres del Paine está localizado na Patagônia, no Chile, e é famoso por suas montanhas, geleiras e lagos.",
    "Onde está a Ilha de Páscoa?": "A Ilha de Páscoa, também conhecida como Rapa Nui, está localizada no Oceano Pacífico, pertencente ao Chile, famosa por suas estátuas Moai.",
    "Onde fica o Monte Kilimanjaro?": "O Monte Kilimanjaro está localizado na Tanzânia, é a montanha mais alta da África, com 5.895 metros de altura.",
    "Onde está o Parque Nacional de Aoraki/Mount Cook?": "O Parque Nacional de Aoraki/Mount Cook está na Nova Zelândia, famoso pelo Monte Cook, o pico mais alto do país.",
    "Onde fica o Vale de Lauterbrunnen?": "O Vale de Lauterbrunnen está na Suíça, conhecido por suas impressionantes quedas d'água e paisagens alpinas.",
    "Onde está o Parque Nacional Torres del Paine?": "O Parque Nacional Torres del Paine está na Patagônia, no Chile, e é famoso por suas montanhas imponentes e lagos de cor esmeralda.",
    "Onde fica a cidade de Machu Picchu?": "Machu Picchu está localizada no Peru, nas montanhas dos Andes, e é uma das novas sete maravilhas do mundo.",
    "Onde está a Ilha de Borneo?": "A Ilha de Borneo está no Sudeste Asiático, dividida entre Malásia, Brunei e Indonésia, e é famosa por sua biodiversidade.",
    "Onde está o Monte Everest?": "O Monte Everest está na fronteira entre o Nepal e o Tibete (China), sendo a montanha mais alta do mundo, com 8.848 metros de altura.",
    "Onde está o Parque Nacional de Banff?": "O Parque Nacional de Banff está no Canadá, na província de Alberta, famoso por suas montanhas, lagos e vida selvagem.",
    "Onde fica o Deserto de Atacama?": "O Deserto de Atacama está no norte do Chile, é o deserto mais seco do mundo.",
    "Onde está o Arquipélago de Galápagos?": "O Arquipélago de Galápagos está no Equador, no Oceano Pacífico, e é famoso pela sua fauna única e biodiversidade.",
    "Onde fica o Parque Nacional de Yellowstone?": "O Parque Nacional de Yellowstone está nos Estados Unidos, abrangendo os estados de Wyoming, Montana e Idaho, e é famoso por seus gêiseres e vida selvagem.",
    "Onde está o Deserto de Wadi Rum?": "O Deserto de Wadi Rum está na Jordânia, conhecido por suas formações rochosas impressionantes e paisagens lunares.",
    "Onde está o Lago Genebra?": "O Lago Genebra está entre a Suíça e a França, sendo um dos maiores lagos da Europa Ocidental.",
    "Onde fica a Ilha de Skye?": "A Ilha de Skye está na Escócia, famosa por suas paisagens dramáticas, com montanhas, lagos e falésias.",
    "Onde está o Parque Nacional de Kruger?": "O Parque Nacional de Kruger está na África do Sul, conhecido por ser um dos melhores destinos para safáris na África.",
    "Onde está o Vale do Rio Amazonas?": "O Vale do Rio Amazonas abrange nove países da América do Sul, sendo a maior floresta tropical do mundo.",
    "Onde fica a Ilha de Santorini?": "A Ilha de Santorini está no Mar Egeu, na Grécia, e é famosa por suas casas brancas e vistas espetaculares.",
    "Onde está o Parque Nacional de Yosemite?": "O Parque Nacional de Yosemite está na Califórnia, EUA, e é famoso por suas falésias de granito e cachoeiras.",
    "Onde está o Lago de Como?": "O Lago de Como está na Itália, e é conhecido por sua beleza natural e as vilas elegantes ao redor de suas águas.",
    "Onde fica a Grande Barreira de Coral?": "A Grande Barreira de Coral está na Austrália, no Mar de Coral, e é o maior sistema de recifes de corais do mundo.",
    "Onde está o Parque Nacional de Galápagos?": "O Parque Nacional de Galápagos está no Equador, no Oceano Pacífico, conhecido por sua biodiversidade única e vida selvagem.",
    "Onde estão as Ilhas Maldivas?": "As Ilhas Maldivas estão no Oceano Índico, a sudoeste da Índia, e são famosas por suas praias paradisíacas e águas cristalinas.",
    "Onde fica o Parque Nacional de Zhangjiajie?": "O Parque Nacional de Zhangjiajie está na China, famoso por suas imponentes formações rochosas que inspiraram o filme 'Avatar'.",
    "Onde está a Ilha de Okinawa?": "A Ilha de Okinawa está no Japão, conhecida por suas praias, cultura distinta e longevidade de seus habitantes.",
    "Onde fica o Deserto de Gobi?": "O Deserto de Gobi está na Mongólia e na China, sendo um dos desertos mais frios e áridos do mundo.",
    "Onde está o Vale de Geysir?": "O Vale de Geysir está na Islândia, famoso pelos gêiseres e fontes termais, incluindo o famoso Geysir.",
    "Onde fica o Parque Nacional de Etosha?": "O Parque Nacional de Etosha está na Namíbia, famoso por sua grande concentração de animais selvagens e paisagens secas.",
    "Onde está o Lago Pichola?": "O Lago Pichola está na cidade de Udaipur, na Índia, conhecido por suas paisagens pitorescas e palácios à beira do lago.",
    "Onde está o Vulcão de Kilauea?": "O Vulcão de Kilauea está no Havai, EUA, e é um dos vulcões mais ativos do mundo.",
    "Onde fica a Ilha de Vang Vien?": "Vang Vien é uma cidade no Laos, famosa por suas paisagens montanhosas e formações cársticas ao redor do rio Nam Song.",
    "Onde está o Lago de Ohrid?": "O Lago de Ohrid está na fronteira entre a Macedônia do Norte e a Albânia, sendo um dos lagos mais antigos e profundos da Europa.",
    "Onde fica o Vale de La Luna?": "O Vale de La Luna está no Deserto do Atacama, no Chile, conhecido por suas formações rochosas e paisagens lunares.",
    "Onde fica o Rio Nilo?": "O Rio Nilo é o mais longo do mundo, fluindo pelo nordeste da África, atravessando diversos países, incluindo o Egito.",
    "Onde está a Ilha de Easter?": "A Ilha de Páscoa (Rapa Nui) está no Chile, no Pacífico, famosa pelas estátuas Moai.",
    "Onde está a Floresta Amazônica?": "A Floresta Amazônica está na América do Sul, abrangendo vários países, incluindo Brasil, Peru e Colômbia.",
    "Onde fica o Parque Nacional de Komodo?": "O Parque Nacional de Komodo está na Indonésia, famoso por ser o lar dos dragões de Komodo, a maior espécie de lagarto do mundo.",
    "O que é a Copa do Mundo?": "A Copa do Mundo é o principal torneio internacional de futebol, organizado pela FIFA, onde seleções de diferentes países competem pelo título de campeã mundial.",
    "Quando foi a primeira Copa do Mundo?": "A primeira Copa do Mundo aconteceu em 1930, no Uruguai, com 13 equipes participantes.",
    "Quem venceu a primeira Copa do Mundo?": "O Uruguai venceu a primeira Copa do Mundo, derrotando a Argentina por 4 a 2 na final.",
    "Qual país tem mais títulos da Copa do Mundo?": "O Brasil é o país com mais títulos da Copa do Mundo, com 5 vitórias (1958, 1962, 1970, 1994, 2002).",
    "Quantos países participaram da Copa do Mundo de 2018?": "A Copa do Mundo de 2018 teve 32 países participantes.",
    "Onde será a próxima Copa do Mundo?": "A próxima Copa do Mundo será no Qatar, em 2022.",
    "Quem é o maior artilheiro da história da Copa do Mundo?": "Marta, do Brasil, é a maior artilheira da história da Copa do Mundo, com 17 gols.",
    "Quem venceu a Copa do Mundo de 2014?": "A Copa do Mundo de 2014 foi vencida pela Alemanha, que derrotou a Argentina por 1 a 0 na final.",
    "Quantas edições da Copa do Mundo aconteceram até 2022?": "Até 2022, aconteceram 22 edições da Copa do Mundo.",
    "Em que ano a Copa do Mundo foi realizada no Brasil?": "A Copa do Mundo no Brasil foi realizada em 2014.",
    "Quem foi o artilheiro da Copa do Mundo de 2018?": "Harry Kane, da Inglaterra, foi o artilheiro da Copa do Mundo de 2018, com 6 gols.",
    "Quem é o jogador com mais gols em Copas do Mundo?": "Marta, do Brasil, é a jogadora com mais gols em Copas do Mundo, com 17 gols.",
    "Qual país venceu a Copa do Mundo de 1998?": "A França venceu a Copa do Mundo de 1998, derrotando o Brasil por 3 a 0 na final.",
    "Qual país foi o anfitrião da Copa do Mundo de 2006?": "A Alemanha foi o país anfitrião da Copa do Mundo de 2006.",
    "Onde foi realizada a Copa do Mundo de 1986?": "A Copa do Mundo de 1986 foi realizada no México.",
    "Quem marcou o gol 'Mão de Deus' na Copa de 1986?": "Diego Maradona, da Argentina, marcou o famoso gol conhecido como 'Mão de Deus' na Copa do Mundo de 1986.",
    "Quando a Copa do Mundo teve a primeira edição com a participação de 32 times?": "A Copa do Mundo com 32 times foi a edição de 1998, na França.",
    "Qual seleção venceu a Copa do Mundo de 2010?": "A Espanha venceu a Copa do Mundo de 2010, derrotando os Países Baixos por 1 a 0 na final.",
    "Quem é o jogador mais jovem a vencer uma Copa do Mundo?": "Pelé, do Brasil, é o jogador mais jovem a vencer uma Copa do Mundo, aos 17 anos, em 1958.",
    "Onde será a Copa do Mundo de 2026?": "A Copa do Mundo de 2026 será realizada nos Estados Unidos, México e Canadá.",
    "Quem foi o artilheiro da Copa do Mundo de 2002?": "Ronaldo, do Brasil, foi o artilheiro da Copa do Mundo de 2002, com 8 gols.",
    "Qual país venceu a Copa do Mundo de 1970?": "O Brasil venceu a Copa do Mundo de 1970, derrotando a Itália por 4 a 1 na final.",
    "Quantos gols Pelé marcou em Copas do Mundo?": "Pelé marcou 12 gols em Copas do Mundo.",
    "Qual foi o maior placar da história da Copa do Mundo?": "O maior placar da história da Copa do Mundo foi 10 a 1, na partida entre Hungria e El Salvador em 1982.",
    "Quem foi o capitão da seleção argentina que venceu a Copa de 1986?": "Diego Maradona foi o capitão da seleção argentina que venceu a Copa de 1986.",
    "Quem foi o treinador da seleção alemã na Copa do Mundo de 2014?": "Joachim Löw foi o treinador da seleção alemã na Copa do Mundo de 2014.",
    "Quem venceu a Copa do Mundo de 1966?": "A Inglaterra venceu a Copa do Mundo de 1966, derrotando a Alemanha Ocidental por 4 a 2 na final.",
    "Onde foi realizada a Copa do Mundo de 1978?": "A Copa do Mundo de 1978 foi realizada na Argentina.",
    "Qual seleção venceu a Copa do Mundo de 1962?": "O Brasil venceu a Copa do Mundo de 1962, derrotando a Tchecoslováquia por 3 a 1 na final.",
    "Quem marcou o gol decisivo na final da Copa de 2014?": "Mario Götze, da Alemanha, marcou o gol decisivo na final da Copa de 2014 contra a Argentina.",
    "Quantos gols Ronaldo Fenômeno marcou em Copas do Mundo?": "Ronaldo Fenômeno marcou 15 gols em Copas do Mundo.",
    "Em qual Copa do Mundo o Brasil perdeu por 7 a 1 para a Alemanha?": "O Brasil perdeu por 7 a 1 para a Alemanha na Copa do Mundo de 2014.",
    "Quantos países já sediaram a Copa do Mundo?": "Até 2022, 17 países já sediaram a Copa do Mundo.",
    "Qual seleção venceu a Copa do Mundo de 1950?": "O Uruguai venceu a Copa do Mundo de 1950, em uma final histórica contra o Brasil no Maracanã.",
    "Quantos gols Messi marcou em Copas do Mundo até 2022?": "Lionel Messi marcou 13 gols em Copas do Mundo até 2022.",
    "Quem foi o artilheiro da Copa do Mundo de 1994?": "O artilheiro da Copa do Mundo de 1994 foi Oleg Salenko, da Rússia, com 6 gols.",
    "Em qual Copa do Mundo o Brasil conquistou seu quinto título?": "O Brasil conquistou seu quinto título da Copa do Mundo em 2002, no Japão e na Coreia do Sul.",
    "Qual país venceu a Copa do Mundo de 1958?": "O Brasil venceu a Copa do Mundo de 1958, derrotando a Suécia por 5 a 2 na final.",
    "Quantos gols Zico marcou em Copas do Mundo?": "Zico não marcou gols em Copas do Mundo, pois não teve uma participação de destaque em edições vencidas pelo Brasil.",
    "Qual foi o gol mais rápido da história da Copa do Mundo?": "O gol mais rápido da história da Copa do Mundo foi marcado por Hakan Şükür da Turquia, aos 11 segundos, na Copa de 2002.",
    "Quem foi o artilheiro da Copa do Mundo de 1990?": "Salvatore Schillaci, da Itália, foi o artilheiro da Copa do Mundo de 1990, com 6 gols.",
    "Quem venceu a Copa do Mundo de 1982?": "A Itália venceu a Copa do Mundo de 1982, derrotando a Alemanha Ocidental por 3 a 1 na final.",
    "Quem é o maior artilheiro da história da seleção brasileira?": "Neymar é o maior artilheiro da história da seleção brasileira, com 77 gols (até 2022).",
    "Quem venceu a Copa do Mundo de 1974?": "A Alemanha Ocidental venceu a Copa do Mundo de 1974, derrotando a Holanda por 2 a 1 na final.",
    "Qual foi a maior derrota da seleção brasileira em Copas do Mundo?": "A maior derrota da seleção brasileira em Copas do Mundo foi para a Alemanha, por 7 a 1, em 2014.",
    "Quem foi o artilheiro da Copa do Mundo de 2006?": "Miroslav Klose, da Alemanha, foi o artilheiro da Copa do Mundo de 2006, com 5 gols.",
    "Onde foi realizada a Copa do Mundo de 1994?": "A Copa do Mundo de 1994 foi realizada nos Estados Unidos.",
    "& \"C:/Users/isaque alves/AppData/Local/Programs/Python/Python312/python.exe\" \"c:/Users/isaque alves/Desktop/Chat_agora_vai_2/chat.py\"": "sair",
    "instagram": "https://www.instagram.com/",
    "you": "https://www.youtube.com/",
    "youtube": "https://www.youtube.com/",
    "insta": "https://www.instagram.com/",
    "Instagram": "https://www.instagram.com/",
    "YouTube": "https://www.youtube.com/",
    "facebook": "https://pt-br.facebook.com/login/device-based/regular/login/",
    "Facebook": "https://pt-br.facebook.com/login/device-based/regular/login/",
    "Face": "https://pt-br.facebook.com/login/device-based/regular/login/",
    "sistema de ponto": "http://192.168.1.80:4000/",
    "Sistema de ponto": "http://192.168.1.80:4000/",
    "Ponto": "http://192.168.1.80:4000/",
    "ponto": "http://192.168.1.80:4000/",
    "servidor M-tech": "http://192.168.1.80:8000/",
    "sevidor M": "http://192.168.1.80:8000/",
    "Sevidor": "http://192.168.1.80:8000/",
    "sevidor": "http://192.168.1.80:8000/",
    "chatgpt": "https://chatgpt.com/",
    "Chatgpt": "https://chatgpt.com/",
    "gpt": "https://chatgpt.com/",
    "GPT": "https://chatgpt.com/",
    "Gpt": "https://chatgpt.com/",
    "GitHub": "https://github.com/",
    "Git": "https://github.com/",
    "git": "https://github.com/",
    "hub": "https://github.com/",
    "minha familia": "sua mâe Cristina,seu padrasto adenilton, sua irmã Ketlem,sua irmâ Ester",
    "salve": "Eae Isaque, Suave?, boa aula pra vc!!",
    "Salve": "Eae Isaque,Suave",
    "valeu": "tamo junto!",
    "vlw": "tmjt",
    "whatsapp": "https://www.whatsapp.com/?lang=pt_BR",
    "watts": "https://www.whatsapp.com/?lang=pt_BR"
}